In [139]:
import pandas as pd

In [140]:
records = {
    'id': [100, 102, 103],
    'name': ["Shafeeq", "Lucy", "John"],
    'marks': [29, 49, 100]
}

In [141]:
df = pd.DataFrame(records)

In [142]:
print(df)

    id     name  marks
0  100  Shafeeq     29
1  102     Lucy     49
2  103     John    100

In [143]:
print(df.describe())

               id       marks
count    3.000000    3.000000
mean   101.666667   59.333333
std      1.527525   36.610563
min    100.000000   29.000000
25%    101.000000   39.000000
50%    102.000000   49.000000
75%    102.500000   74.500000
max    103.000000  100.000000

In [144]:
print(df.columns)

Index(['id', 'name', 'marks'], dtype='object')

In [145]:
df.columns = ["RegistrationNumber", "StudentName", "ExamMarks"]

In [146]:
print(df)

   RegistrationNumber StudentName  ExamMarks
0                 100     Shafeeq         29
1                 102        Lucy         49
2                 103        John        100

In [147]:
print(df.head())

   RegistrationNumber StudentName  ExamMarks
0                 100     Shafeeq         29
1                 102        Lucy         49
2                 103        John        100

In [148]:
df[2:]

   RegistrationNumber StudentName  ExamMarks
2                 103        John        100

In [149]:
df[['RegistrationNumber','StudentName']]

   RegistrationNumber StudentName
0                 100     Shafeeq
1                 102        Lucy
2                 103        John

In [150]:
df = pd.read_csv('./Sales_Records.csv')

In [151]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02
1,North America,Canada,Vegetables,Online,M,11/07/2011,185941302,12/08/2011,3018,154.06,90.93,464953.08,274426.74,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/09/2016,1517,255.28,159.42,387259.76,241840.14,145419.62
3,Asia,Japan,Cereal,Offline,C,04/10/2010,161442649,05/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,91853.85,68127.40,23726.45

In [152]:
df.tail(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
998,Europe,Finland,Household,Offline,L,1/25/2016,289606320,2/14/2016,9801,668.27,502.54,6549714.27,4925394.54,1624319.73
999,Europe,Portugal,Cereal,Offline,C,04/10/2014,811546599,05/08/2014,3528,205.70,117.11,725709.60,413164.08,312545.52

In [153]:
df[['Region','Country']][1:5].head()

                         Region Country
1                 North America  Canada
2  Middle East and North Africa   Libya
3                          Asia   Japan
4            Sub-Saharan Africa    Chad

In [154]:
amount = df['Unit Price'] * df['Units Sold']

In [155]:
amount.head()

0    3692591.20
1     464953.08
2     387259.76
3     683335.40
4      91853.85
dtype: float64

In [156]:
resultsDf = pd.read_csv('./results.csv')

In [157]:
resultsDf.describe()

              regno     physics  chemistry      maths       salary
count     12.000000   11.000000  11.000000  11.000000    13.000000
mean   14006.750000   76.636364  49.272727  49.818182  1728.000000
std        3.957157   40.652854  22.534822  20.850986  1804.286516
min    14001.000000   12.000000  13.000000  14.000000   567.000000
25%    14003.750000   56.000000  30.500000  35.000000   876.000000
50%    14006.500000   89.000000  55.000000  50.000000   900.000000
75%    14009.500000  105.000000  65.500000  65.000000  1200.000000
max    14013.000000  131.000000  76.000000  78.000000  5678.000000

In [158]:
resultsDf['totalMarks'] = resultsDf['physics']+resultsDf['chemistry']+resultsDf['maths']

In [159]:
resultsDf.head()

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1000,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1200,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1100,203.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,900,NaN
4,14005.0,John,120.0,48.0,50.0,HSBC,java,600,218.0

In [160]:
resultsDf['City']='Manchester'

In [161]:
resultsDf.head()

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,City
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1000,136.0,Manchester
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1200,179.0,Manchester
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1100,203.0,Manchester
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,900,NaN,Manchester
4,14005.0,John,120.0,48.0,50.0,HSBC,java,600,218.0,Manchester

In [162]:
resultsDf.drop('City',1,inplace=True)
resultsDf.head()

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1000,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1200,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1100,203.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,900,NaN
4,14005.0,John,120.0,48.0,50.0,HSBC,java,600,218.0

In [163]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02
1,North America,Canada,Vegetables,Online,M,11/07/2011,185941302,12/08/2011,3018,154.06,90.93,464953.08,274426.74,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/09/2016,1517,255.28,159.42,387259.76,241840.14,145419.62
3,Asia,Japan,Cereal,Offline,C,04/10/2010,161442649,05/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,91853.85,68127.40,23726.45

In [164]:
df['Amount']= df['Unit Price'] * df['Units Sold']+df['Unit Cost']
df[['Country','Item Type','Amount']].head()

  Country   Item Type      Amount
0   Libya   Cosmetics  3692854.53
1  Canada  Vegetables   465044.01
2   Libya   Baby Food   387419.18
3   Japan      Cereal   683452.51
4    Chad      Fruits    91860.77

In [165]:
resultsDf[resultsDf['Client']=='HSBC']

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1200,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1100,203.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,600,218.0
5,14006.0,Lucy,67.0,55.0,NaN,HSBC,python,567,NaN

In [166]:
resultsDf['salary']=resultsDf['salary']*1.1

In [167]:
resultsDf[resultsDf['Client']=='HSBC']

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0
5,14006.0,Lucy,67.0,55.0,NaN,HSBC,python,623.7,NaN

In [168]:
resultsDf[resultsDf['Client']=='HSBC']['name']

1    james
2    james
4     John
5     Lucy
Name: name, dtype: object

In [169]:
resultsDf[(resultsDf['Client']=='HSBC') & (resultsDf['totalMarks']/450 > 0.2)]['name']

1    james
2    james
4     John
Name: name, dtype: object

In [170]:
resultsDf['totalMarks2'] = resultsDf[['physics','chemistry','maths']].sum(axis=1)
resultsDf

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,990.0,NaN,56.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
5,14006.0,Lucy,67.0,55.0,NaN,HSBC,python,623.7,NaN,122.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
7,14008.0,Jason Bourn,NaN,69.0,68.0,NBS,sql,963.6,NaN,137.0
8,14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,988.9,NaN,0.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [171]:
resultsDf.dropna()

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
8,14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [172]:
resultsDf.dropna(subset=['maths'])

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,990.0,NaN,56.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
7,14008.0,Jason Bourn,NaN,69.0,68.0,NBS,sql,963.6,NaN,137.0
8,14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [173]:
resultsDf.fillna(0)

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
3,14004.0,Saeed,12.0,0.0,44.0,IBM,python,990.0,0.0,56.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
5,14006.0,Lucy,67.0,55.0,0.0,HSBC,python,623.7,0.0,122.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
7,14008.0,Jason Bourn,0.0,69.0,68.0,NBS,sql,963.6,0.0,137.0
8,14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
9,0.0,0,0.0,0.0,0.0,0,0,988.9,0.0,0.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [176]:
resultsDf.sort_values(["name","physics","regno"],ascending=[True,False,False])

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0
7,14008.0,Jason Bourn,NaN,69.0,68.0,NBS,sql,963.6,NaN,137.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
8,14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
5,14006.0,Lucy,67.0,55.0,NaN,HSBC,python,623.7,NaN,122.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,990.0,NaN,56.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,988.9,NaN,0.0

In [181]:
resultsDf[(resultsDf['Client'].isin(['ONS','IBM'])) & (resultsDf['Subject']=='java')]

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
0,14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
12,14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [183]:
resultsDf[~resultsDf['physics'].between(80,100)]

,regno,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
1,14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
2,14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
3,14004.0,Saeed,12.0,NaN,44.0,IBM,python,990.0,NaN,56.0
4,14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
5,14006.0,Lucy,67.0,55.0,NaN,HSBC,python,623.7,NaN,122.0
6,14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
7,14008.0,Jason Bourn,NaN,69.0,68.0,NBS,sql,963.6,NaN,137.0
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,988.9,NaN,0.0
10,14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
11,14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0

In [190]:
resultsDf.dropna(inplace=True)

In [194]:
resultsDf.set_index(keys='regno',inplace=True)

KeyError: "None of ['regno'] are in the columns"

In [195]:
resultsDf

,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
regno,,,,,,,,,
14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0
14007.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
14009.0,Kajol,90.0,76.0,74.0,Barclays,php,990.0,240.0,240.0
14011.0,Peter,12.0,13.0,14.0,ONS,php,842.6,39.0,39.0
14012.0,Tom,56.0,62.0,62.0,ONS,oracle,6245.8,180.0,180.0
14013.0,Ali,89.0,76.0,78.0,IBM,java,2530.0,243.0,243.0

In [197]:
resultsDf.loc[14002]

name             james
physics            120
chemistry           27
maths               32
Client            HSBC
Subject        c sharp
salary            1320
totalMarks         179
totalMarks2        179
Name: 14002.0, dtype: object

In [198]:
resultsDf.loc[[14002,14005]]

,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
regno,,,,,,,,,
14002,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
14005,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0

In [199]:
resultsDf.iloc[3]

name           John
physics         120
chemistry        48
maths            50
Client         HSBC
Subject        java
salary          660
totalMarks      218
totalMarks2     218
Name: 14005.0, dtype: object

In [201]:
resultsDf.iloc[[1,2,3]]

,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
regno,,,,,,,,,
14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0

In [202]:
resultsDf.iloc[:4]

,name,physics,chemistry,maths,Client,Subject,salary,totalMarks,totalMarks2
regno,,,,,,,,,
14001.0,shafeeq,90.0,20.0,26.0,IBM,java,1100.0,136.0,136.0
14002.0,james,120.0,27.0,32.0,HSBC,c sharp,1320.0,179.0,179.0
14003.0,james,131.0,34.0,38.0,HSBC,python,1210.0,203.0,203.0
14005.0,John,120.0,48.0,50.0,HSBC,java,660.0,218.0,218.0